In [1]:
import pandas as pd

In [6]:
#df = pd.read_excel(r"C:\Users\shash\Desktop\Ranks-converted.xls")
#df.head()

In [7]:
#df.sort_values(by=['Ranks','PM']).head(10)

In [8]:
df1= pd.read_excel(r"C:\Users\shash\Desktop\gcet2021.xls")

In [9]:
df1.head()

   ROLLNO PHY_MKS CHE_MKS MAT_MKS
0   10001      24      28      35
1   10002      33      21      30
2   10003      30      36      56
3   10004      12      19      33
4   10005      28      22      44

In [11]:
df1.shape

(2935, 4)

In [ ]:
#PM = df1["PHY_MKS"] + df1["MAT_MKS"]
#df1["col3"] = PM
#print(df1)

In [12]:
df1.isnull().sum()

ROLLNO     0
PHY_MKS    0
CHE_MKS    0
MAT_MKS    0
dtype: int64

In [13]:
df1["MAT_MKS"].unique()

array([35, 30, 56, 33, 44, 51, 15, 26, 17, 24, 20, 41, 18, 50, 22, 49, 28,
       29, 34, 32, 25, 37, 21, 27, 31, 65, 19, 23, 47, 36, 42, 38, 48, 43,
       14, 39, 'A', 16, 12, 53, 64, 52, '-', 57, 40, 59, 71, 13, 73, 46,
       68, 62, 45, 58, 54, 69, 11, 72, 61, 55, 9, 66, 10, 67, 70],
      dtype=object)

In [19]:
#df2= df.drop(df[df['Age'] < 25].index, inplace = True)
#df2 = df1.drop(['MAT_MKS'] == '-')

In [ ]:
# details = {
#     'Name' : ['Ankit', 'Aishwarya', 'Shaurya',
#               'Shivangi', 'Priya', 'Swapnil'],
#     'Age' : [23, 21, 22, 21, 24, 25],
#     'University' : ['BHU', 'JNU', 'DU', 'BHU', 
#                     'Geu', 'Geu'],
# }
  
# # creating a Dataframe object 
# df = pd.DataFrame(details, columns = ['Name', 'Age',
#                                       'University'],
#                   index = ['a', 'b', 'c', 'd', 'e',
#                            'f'])

In [20]:
df1["PHY_MKS"].unique()

array([24, 33, 30, 12, 28, 26, 16, 22, 19, 20, 23, 32, 29, 25, 18, 21, 15,
       13, 36, 14, 37, 17, 27, 35, 11, 'A', 8, 41, 44, 31, 54, 34, 48, 43,
       58, 39, 40, 42, 53, 10, 9, 38, 6, 56, 49, 52, 59, 55, 46, 45, 1,
       50], dtype=object)

In [21]:
df1["CHE_MKS"].unique()

array([28, 21, 36, 19, 22, 23, 27, 33, 25, 26, 18, 16, 31, 20, 30, 17, 39,
       44, 29, 32, 54, 14, 42, 41, 24, 38, 34, 49, 13, 'A', 56, 15, 37,
       62, 35, 12, 63, 60, 64, 58, 45, 46, 40, 57, 69, 59, 43, 48, 55, 68,
       52, 50, 67, 47, 51, 10, 70, 53, 11, 9, 65, 61], dtype=object)

In [23]:
df1[ df1['MAT_MKS'] == '-' ].index

Int64Index([ 151,  152,  153,  154,  155,  156,  157,  158,  159,  160,
            ...
            2925, 2926, 2927, 2928, 2929, 2930, 2931, 2932, 2933, 2934],
           dtype='int64', length=806)

In [28]:
print(df1['MAT_MKS'] == 'A')

0       False
1       False
2       False
3       False
4       False
        ...
2930    False
2931    False
2932    False
2933    False
2934    False
Name: MAT_MKS, Length: 2935, dtype: bool

In [30]:
df1 = df1.drop(df1[df1['MAT_MKS'] == 'A'].index)
print(df1)

      ROLLNO PHY_MKS CHE_MKS MAT_MKS
0      10001      24      28      35
1      10002      33      21      30
2      10003      30      36      56
3      10004      12      19      33
4      10005      28      22      44
...      ...     ...     ...     ...
2930   25554      14      29       -
2931   25555      20      18       -
2932   25556      23      21       -
2933   25557      16      36       -
2934   25558      23      17       -

[2839 rows x 4 columns]

In [32]:
df1['MAT_MKS'].unique()

array([35, 30, 56, 33, 44, 51, 15, 26, 17, 24, 20, 41, 18, 50, 22, 49, 28,
       29, 34, 32, 25, 37, 21, 27, 31, 65, 19, 23, 47, 36, 42, 38, 48, 43,
       14, 39, 16, 12, 53, 64, 52, '-', 57, 40, 59, 71, 13, 73, 46, 68,
       62, 45, 58, 54, 69, 11, 72, 61, 55, 9, 66, 10, 67, 70],
      dtype=object)

In [33]:
df1 = df1.drop(df1[df1['MAT_MKS'] == '-'].index)
print(df1)

      ROLLNO PHY_MKS CHE_MKS MAT_MKS
0      10001      24      28      35
1      10002      33      21      30
2      10003      30      36      56
3      10004      12      19      33
4      10005      28      22      44
...      ...     ...     ...     ...
2871   25193      15      19      14
2872   25194      13      34      24
2874   25196      20      26      33
2875   25197      27      24      26
2876   25198       9      18      31

[2033 rows x 4 columns]

In [34]:
df1['MAT_MKS'].unique()

array([35, 30, 56, 33, 44, 51, 15, 26, 17, 24, 20, 41, 18, 50, 22, 49, 28,
       29, 34, 32, 25, 37, 21, 27, 31, 65, 19, 23, 47, 36, 42, 38, 48, 43,
       14, 39, 16, 12, 53, 64, 52, 57, 40, 59, 71, 13, 73, 46, 68, 62, 45,
       58, 54, 69, 11, 72, 61, 55, 9, 66, 10, 67, 70], dtype=object)

In [35]:
df1 = df1.drop(df1[df1['PHY_MKS'] == 'A'].index)
print(df1)

      ROLLNO PHY_MKS CHE_MKS MAT_MKS
0      10001      24      28      35
1      10002      33      21      30
2      10003      30      36      56
3      10004      12      19      33
4      10005      28      22      44
...      ...     ...     ...     ...
2871   25193      15      19      14
2872   25194      13      34      24
2874   25196      20      26      33
2875   25197      27      24      26
2876   25198       9      18      31

[2032 rows x 4 columns]

In [36]:
df1 = df1.drop(df1[df1['CHE_MKS'] == 'A'].index)
print(df1)

      ROLLNO PHY_MKS CHE_MKS MAT_MKS
0      10001      24      28      35
1      10002      33      21      30
2      10003      30      36      56
3      10004      12      19      33
4      10005      28      22      44
...      ...     ...     ...     ...
2871   25193      15      19      14
2872   25194      13      34      24
2874   25196      20      26      33
2875   25197      27      24      26
2876   25198       9      18      31

[2016 rows x 4 columns]

In [37]:
df1.head(2016)

      ROLLNO PHY_MKS CHE_MKS MAT_MKS
0      10001      24      28      35
1      10002      33      21      30
2      10003      30      36      56
3      10004      12      19      33
4      10005      28      22      44
...      ...     ...     ...     ...
2871   25193      15      19      14
2872   25194      13      34      24
2874   25196      20      26      33
2875   25197      27      24      26
2876   25198       9      18      31

[2016 rows x 4 columns]

In [39]:
PM = df1["PHY_MKS"] + df1["MAT_MKS"]
df1["PM"] = PM
print(df1.head())

   ROLLNO PHY_MKS CHE_MKS MAT_MKS  PM
0   10001      24      28      35  59
1   10002      33      21      30  63
2   10003      30      36      56  86
3   10004      12      19      33  45
4   10005      28      22      44  72

In [40]:
df1.to_excel("new_generated.xlsx",
             sheet_name='Sheet_name_1')

In [48]:
df2= pd.read_excel(r"C:\Users\shash\Desktop\new_generated.xlsx")
df2.head()

   ROLLNO  PHY_MKS  CHE_MKS  MAT_MKS  PM
0   10001       24       28       35  59
1   10002       33       21       30  63
2   10003       30       36       56  86
3   10004       12       19       33  45
4   10005       28       22       44  72

In [46]:
#df2.drop([Unnamed],axis=1)

NameError: name 'Unnamed' is not defined

In [56]:
df2.sort_values('PM', axis=0 , ascending = False,inplace=True)

In [57]:
df2

      ROLLNO  PHY_MKS  CHE_MKS  MAT_MKS   PM
197    11058       58       64       73  131
989    16024       59       56       71  130
660    14023       56       67       73  129
1906   25083       55       65       71  126
940    15196       52       70       73  125
...      ...      ...      ...      ...  ...
487    13078       11       22       14   25
384    12127        9       15       15   24
1896   25073       10       21       14   24
1852   25028       12       19       12   24
951    15207       12       16        9   21

[2016 rows x 5 columns]

In [58]:
df2.to_excel("final_sorted1.xlsx",
             sheet_name='Sheet_name_2')